In [8]:
import pandas as pd

In [9]:
source_file_education = 'Resources/education/Current v Former 2.csv'

In [10]:
education_2015 = pd.read_csv(source_file_education,header=None)
education_2015.columns = ["state",'graduation rate','whatever']

In [11]:
education_2015 = education_2015.drop(education_2015.index[0])

education_2015.head(5)

      state graduation rate whatever
1  NATIONAL            84.1        5
2   Alabama            87.1       15
3    Alaska            76.1        8
4   Arizona            79.5        2
5  Arkansas              87        6

In [12]:
education_2015 = education_2015.iloc[1:]

In [18]:
education_2015.head()

        state graduation rate
2     Alabama            87.1
3      Alaska            76.1
4     Arizona            79.5
5    Arkansas              87
6  California              83

In [15]:
education_2015 = education_2015[['state','graduation rate']]

In [19]:
education_2015.head()

        state graduation rate
2     Alabama            87.1
3      Alaska            76.1
4     Arizona            79.5
5    Arkansas              87
6  California              83